{
  "title": "Correspondence Clerk User Guide",
  "sections": [
    {
      "level": 1,
      "title": "Correspondence Clerk User Guide",
      "content": "Welcome to Correspondence Clerk! This guide will help you get started and make the most of your digital letter file system."
    },
    {
      "level": 2,
      "title": "Table of Contents",
      "content": "Getting Started (#getting-started)\nCore Features (#core-features)\nUnderstanding Your Data (#understanding-your-data)\nCommon Questions (FAQ) (#common-questions-faq)\nTroubleshooting (#troubleshooting)\nFor Team Administrators (#for-team-administrators)\nGlossary (#glossary)"
    },
    {
      "level": 2,
      "title": "Getting Started",
      "content": ""
    },
    {
      "level": 3,
      "title": "What is Correspondence Clerk?",
      "content": "Correspondence Clerk is your digital filing system for business correspondence. Think of it as replacing those Word documents where you used to copy and paste emails and call notes. Instead of manually maintaining letter files for each business, Correspondence Clerk does it automatically.\n\nWhat it does:\n• Files emails, calls, and meeting notes in one place\n• Organizes everything by business, in chronological order\n• Makes past correspondence instantly searchable\n• Generates print-ready documents when you need them\n• Helps teams share visibility into business relationships\n\nWhat it doesn't do:\n• It's not a CRM - no sales pipeline or deal tracking\n• It doesn't suggest next steps or auto-follow-ups\n• It doesn't rewrite your words - it preserves your voice exactly"
    },
    {
      "level": 3,
      "title": "Quick Overview (5-Minute Tour)",
      "content": "Dashboard - See all your businesses at a glance, sorted by what needs attention\nNew Entry - Paste an email or type call notes, select the business and person\nBusiness Letter File - View the complete correspondence history for any business\nSearch - Find past conversations by keyword or business name\nExport - Generate a Google Doc with all correspondence for a business"
    },
    {
      "level": 3,
      "title": "How to Log In",
      "content": "Open your browser and go to your Correspondence Clerk URL (provided by your administrator)\nEnter your email address and password\nIf you're a new team member, use the invitation link sent to your email\n\nFirst time logging in?\n• You'll be asked to create an organization (if you're the first user)\n• Or you'll join an existing organization (if you were invited)"
    },
    {
      "level": 3,
      "title": "First-Time Setup",
      "content": "If you're starting fresh:\nLog in and create your organization\nImport your business list (optional - you can also add them as you go)\nStart filing correspondence\n\nIf you're joining a team:\nAccept your invitation via email\nYou'll immediately see all businesses and correspondence your team has filed\nStart adding new entries right away"
    },
    {
      "level": 2,
      "title": "Core Features",
      "content": ""
    },
    {
      "level": 3,
      "title": "Dashboard Overview",
      "content": "The Dashboard is your home base. It answers one question: What needs doing?\n\nHow it's sorted:\nAction needed - businesses with follow-ups, invoices, or renewals\nOverdue - entries with past-due dates\nLeast recently contacted - businesses you haven't touched in a while\n\nEach business card shows:\n• Business name\n• Category (e.g., Club Card, Advertiser)\n• Status flags\n• Last contacted date\n• Action needed badge (if any)\n• Overdue badge (if any)\n\nFiltering options:\n• All businesses\n• Club Card only\n• Advertiser only\n• Action needed only\n\nQuick actions:\n• Click any card to view the full letter file\n• Search bar at the top to find a business by name"
    },
    {
      "level": 3,
      "title": "Creating a New Entry",
      "content": "This is how you file correspondence - whether it's an email, phone call, or meeting notes.\n\nStep 1: Paste or type your content\n\nIn the large text area, you can:\n• Paste an entire email (including headers and thread history)\n• Type notes from a phone call\n• Copy meeting notes\n\nStep 2: Select the business\n\nStart typing the business name and select from the dropdown. If the business doesn't exist:\n• Click \"Add New Business\"\n• Enter the name and optional details\n• Save and continue\n\nStep 3: Select the contact\n\nChoose the person you corresponded with. The dropdown shows:\n• Contact name\n• Role (if recorded)\n• Email address (if recorded)\n\nIf the person doesn't exist:\n• Click \"Add New Contact\"\n• Enter their name (required)\n• Add their role, email, phone (optional but recommended)\n\nWhy you must name a contact:\nThis ensures your letter file is always clear about who you spoke with. No \"Unknown\" placeholders allowed.\n\nStep 4: Set optional fields\n• Entry type - Email, Call, or Meeting (auto-detected from pasted content)\n• Action needed - Mark if follow-up is required (none, prospect, follow-up, etc.)\n• Due date - Set a reminder date for follow-ups\n\nStep 5: Save\n\nClick \"Save Entry\" and you're done. The entry is filed, the business letter file is updated, and the dashboard reflects the new activity.\n\nWhat happens when you save:\nYour original text is preserved exactly as entered\nAI improves the layout and spacing (if available)\nThe entry appears in the business letter file\nBusiness \"last contacted\" date is updated\nYou're taken to the business page to see the saved entry\n\nIf AI formatting fails:\nDon't worry - your entry saves anyway as \"unformatted\". You can format it later when the AI service is back online."
    },
    {
      "level": 3,
      "title": "Understanding Email Thread Splitting",
      "content": "When you paste an email chain (multiple back-and-forth emails), Correspondence Clerk can detect it and offer to split it into individual entries.\n\nHow it works:\nPaste an email thread\nIf detected, you'll see a toggle: \"Split into individual emails\"\nToggle ON to split, OFF to keep as one entry\nPreview shows how many entries will be created\nConfirm and save\n\nWhen to split:\n• Long email threads with multiple back-and-forth messages\n• When you want each email dated separately in the letter file\n\nWhen not to split:\n• Single email with quoted history at the bottom\n• Call notes or meeting notes (not applicable)\n• Short exchanges where one entry is clearer\n\nWhat gets split:\n• Each distinct email in the thread\n• In chronological order (oldest first)\n• Each gets its own date, sender, subject\n\nWhat doesn't get split:\n• AI doesn't invent missing emails\n• Incomplete threads stay intact\n• If uncertain, splitting is turned OFF by default"
    },
    {
      "level": 3,
      "title": "Searching for Past Correspondence",
      "content": "Find anything you've filed, fast.\n\nSearch by business name:\n• Type in the search bar\n• Results prioritize business name matches\n• Click any result to view that business's letter file\n\nSearch by keyword:\n• Type any word or phrase from past correspondence\n• Results show matching entries across all businesses\n• Highlights show where your search term appears\n\nSearch tips:\n• Use specific terms (e.g., \"contract renewal\" not \"contract\")\n• Business names always rank higher than keyword matches\n• Search is case-insensitive\n• Searches across both original and formatted text\n\nResults show:\n• Business name\n• Entry date and type\n• Contact name\n• Snippet with your search term highlighted\n• Quick link to view the full entry"
    },
    {
      "level": 3,
      "title": "Exporting to Google Docs",
      "content": "Create a print-ready Google Doc with all correspondence for a business.\n\nHow to export:\nOpen any business letter file\nClick \"Export to Google Docs\"\nWait a few seconds (longer for businesses with many entries)\nA link to your new Google Doc appears\n\nWhat's included:\n• Cover page with business name, category, status\n• Contact list with roles and details\n• All correspondence entries in chronological order\n• Page break between each entry\n• Entry format: Subject, date/type/contact, formatted text\n\nWhat's not included:\n• Original unformatted text (only the clean formatted version)\n• Deleted entries\n• Draft entries (if applicable in future versions)\n\nWhere does it go:\nThe Google Doc is created in your Google Drive, in the same folder as the document (or root if no folder specified).\n\nTip:\nYou can share, print, or further edit the Google Doc as needed. It's yours."
    },
    {
      "level": 3,
      "title": "Managing Contacts and Businesses",
      "content": "Viewing contacts for a business:\nOpen any business letter file\nScroll to the \"Contacts\" section\nSee all recorded contacts with roles, emails, phones\n\nAdding a new contact:\n• From the New Entry page: Click \"Add New Contact\" when selecting\n• From the Business page: Click \"Add Contact\" in the Contacts section\n\nEditing contact details:\n• Click the edit icon next to any contact\n• Update name, role, email, phone\n• Changes apply immediately\n\nWhy contact details matter:\nWhen you file correspondence, seeing role and contact details helps you:\n• Confirm you're selecting the right person\n• Update info as you learn it (promotions, new emails, etc.)\n• Keep your letter file clear about who is who\n\nAdding a new business:\n• From the New Entry page: Click \"Add New Business\" when selecting\n• From the Dashboard: Use the \"New Business\" button (if available)\n• From import: Bulk import businesses from CSV (admin feature)\n\nEditing business details:\n• Open the business letter file\n• Click \"Edit Business\" (if available)\n• Update name, category, status, flags"
    },
    {
      "level": 3,
      "title": "Team Collaboration",
      "content": "Who sees what:\nIn Correspondence Clerk, everyone in your organization sees all businesses and correspondence. This ensures team visibility and prevents duplicated effort.\n\nWhen you file an entry:\n• It's attributed to you (your name appears on the entry)\n• But everyone can see it, search it, and export it\n• This is by design - shared knowledge is the goal\n\nInviting team members:\nGo to Settings > Organization\nEnter their email address\nThey receive an invitation link\nOnce accepted, they're part of your team\n\nRevoking access:\n(Future feature - currently all team members have equal access)"
    },
    {
      "level": 2,
      "title": "Understanding Your Data",
      "content": ""
    },
    {
      "level": 3,
      "title": "What Gets Saved When You Create an Entry",
      "content": "Every correspondence entry stores multiple versions:\nraw_text_original - Your exact input, never modified\nformatted_text_original - AI-formatted version when first saved\nformatted_text_current - The version displayed (can be manually edited)\n\nWhy three versions?\n• Safety net: Your original text is always preserved\n• Clarity: Formatted text is easier to read and print\n• Flexibility: You can manually correct errors without losing history\n\nOther saved data:\n• Entry date (auto-detected or manually set)\n• Subject line (guessed from content)\n• Entry type (Email, Call, Meeting)\n• Business and contact links\n• Who created it and when\n• Action needed flag and due date\n• AI processing metadata (for troubleshooting)"
    },
    {
      "level": 3,
      "title": "How the App Preserves Your Original Text",
      "content": "Hard rule: Your words are never rewritten.\n\nWhen AI formats your text, it only:\n• Improves spacing and line breaks\n• Formats bullet points and numbered lists\n• Makes headers more readable\n• Cleans up email artifacts (like quoted text markers)\n\nWhat it doesn't do:\n• Change your wording or tone\n• Summarize or shorten\n• Add suggestions or next steps\n• Invent content\n\nYou can always access the original:\nEvery entry keeps raw_text_original intact forever. If you ever need to see what you originally pasted, it's there."
    },
    {
      "level": 3,
      "title": "Where Backups Are Stored",
      "content": "Your data is stored in a Supabase PostgreSQL database. Supabase handles:\n• Daily automated backups\n• Point-in-time recovery (ask your administrator)\n• Encrypted storage\n• Geographic redundancy\n\nWhat this means for you:\n• Your data is safe from accidental deletion\n• Catastrophic failures are recoverable\n• You don't need to manually back up\n\nExporting for local backup:\nYou can export any business to Google Docs, which creates a separate copy in your Google Drive."
    },
    {
      "level": 3,
      "title": "Data Structure Explained Simply",
      "content": "Think of your data like a filing cabinet:\n\nFiling Cabinet = Your Organization\n• Shared by your whole team\n\nDrawer = Businesses\n• Each business has its own drawer\n• Contains all correspondence with that business\n\nFolders = Contacts\n• People at each business\n• Every piece of correspondence is filed under a person\n\nPages = Correspondence Entries\n• Individual emails, call notes, meeting notes\n• In chronological order\n• Each \"page\" includes the date, type, and person involved\n\nConnections:\n• Contacts belong to a business (you can't have a \"floating\" contact)\n• Correspondence always links to both a business and a specific contact\n• If you delete a business, all its contacts and correspondence are deleted (with confirmation)"
    },
    {
      "level": 3,
      "title": "How Your Data is Stored",
      "content": "Businesses\n\nStores every company or organization you track. Each business has:\n• Name and basic details\n• Category - the type of business (e.g., Club Card, Advertiser)\n• Status flags - Club Card (member) and Advertiser flags\n• Last contacted date - automatically updated when you file correspondence\n• Contract information - for members and advertisers\n\nContacts\n\nThe people at each business. Each contact has:\n• Name (required - you must always name a real person)\n• Role or job title - their position at the business\n• Email address - primary contact email\n• Phone number - contact phone\n• Linked to their business - contacts always belong to a specific business\n\nCorrespondence\n\nYour filed emails, calls, and meeting notes. Each entry stores:\n• Original text (raw_text_original) - never changes, your safety net\n• Formatted text (formatted_text_original) - AI-improved layout when first saved\n• Current text (formatted_text_current) - the version shown, can be manually edited\n• Date, type, contact, business links - all the metadata\n• Who saved it and when - tracks which team member created the entry\n• Action needed status - none, prospect, follow-up, waiting on them, invoice, renewal\n• Due date - optional reminder date for follow-ups\n\nOrganizations and Team Members\n\nHow teams share data:\n• Organizations - your company/team workspace\n• User Profiles - each team member's account, linked to an organization\n• Invitations - pending invites sent to team members\n• Shared visibility - everyone in your organization sees all businesses and correspondence\n\nData Safety\n\nYour data is protected through:\n• Original text preservation - we never modify raw_text_original\n• Edit tracking - every edit is timestamped and attributed\n• Foreign key constraints - prevents orphaned data\n• Automatic backups - Supabase handles daily backups\n• Row Level Security - database enforces access permissions"
    },
    {
      "level": 2,
      "title": "Common Questions (FAQ)",
      "content": ""
    },
    {
      "level": 3,
      "title": "Why can't I save without selecting a contact?",
      "content": "This is by design. Correspondence Clerk requires you to name a specific person for every entry because:\n• It keeps your letter file clear about who said what\n• It prevents vague \"someone from XYZ Corp\" entries\n• It builds a useful contact database over time\n\nIf you genuinely don't know the person's name:\n• Ask them (in the case of a call)\n• Check the email headers (for emails)\n• Create a contact like \"Sarah [Last Name Unknown]\" if necessary\n\nThe app won't accept placeholder contacts like \"Unknown\" or \"TBD\" - you must name a real person."
    },
    {
      "level": 3,
      "title": "What happens if AI formatting fails?",
      "content": "You can still save your correspondence. Here's what happens:\nYou paste or type your content\nThe app tries to format it with AI\nIf the AI is unavailable (network issue, API outage, etc.):\n• Your entry saves as \"unformatted\"\n• A \"Format later\" button appears on the entry\nWhen the AI service is back, click \"Format later\" to retry\n\nWhy this matters:\nAI outages never block you from filing correspondence. Your work continues uninterrupted."
    },
    {
      "level": 3,
      "title": "Can I undo a delete?",
      "content": "Currently, deletes are permanent. Before you delete:\n• A confirmation dialog appears\n• You must explicitly confirm\n\nTo prevent accidental deletes:\n• Read the confirmation message carefully\n• Consider archiving instead of deleting (future feature)\n\nIf you accidentally delete:\n• Contact your administrator\n• They can restore from a backup (recent deletes are recoverable)"
    },
    {
      "level": 3,
      "title": "What if I paste an email thread?",
      "content": "Correspondence Clerk detects email chains and offers to split them into individual entries.\n\nThe split toggle:\n• Appears when a thread is detected\n• Shows a preview of how many entries will be created\n• Defaults to ON only when confidence is high\n• You must confirm before splitting happens\n\nIf the detection is wrong:\n• Toggle it OFF to keep as one entry\n• Or manually split by pasting each email separately\n\nWhat if I want to split later?\nYou can't automatically split an existing entry. Instead:\n• Edit the entry to remove parts\n• Create new entries for the removed parts"
    },
    {
      "level": 3,
      "title": "Where do my exports go?",
      "content": "Google Doc exports are created in your Google Drive. Specifically:\n• In the same folder as the document (if the app has folder context)\n• Otherwise, in your Drive root\n\nAfter export:\n• You receive a shareable link\n• The document is yours to edit, share, or print\n• It's not connected back to Correspondence Clerk (it's a snapshot)"
    },
    {
      "level": 3,
      "title": "How often is data backed up?",
      "content": "Supabase handles daily automated backups of your database. Additionally:\n• Point-in-time recovery allows restoring to any moment\n• Your administrator can request a restore if needed\n\nYou can also:\n• Export businesses to Google Docs for your own local backups\n• (Future) Full database export for comprehensive backup"
    },
    {
      "level": 3,
      "title": "Can I edit entries after saving?",
      "content": "Yes, but only the formatted text. Here's how it works:\n\nWhat you can edit:\n• formatted_text_current - the displayed version\n\nWhat you can't edit:\n• raw_text_original - permanently preserved\n• formatted_text_original - permanently preserved\n\nHow to edit:\nOpen the entry\nClick \"Edit\"\nMake your changes\nSave\n\nWhat happens when you edit:\n• edited_at timestamp is updated\n• edited_by records your user ID\n• A small \"edited\" indicator appears on the entry\n• Original versions remain intact\n\nWhy it's designed this way:\nEdits are for corrections (typos, clarifications), not for rewriting history. You always have the original text as proof of what was actually said."
    },
    {
      "level": 3,
      "title": "What if Outlook integration isn't working?",
      "content": "Currently, Correspondence Clerk uses manual copy-paste from Outlook (or any email client). There's no direct integration.\n\nTo file an Outlook email:\nOpen the email in Outlook\nSelect all (Ctrl+A) and copy (Ctrl+C)\nPaste into Correspondence Clerk's New Entry page\nFile as usual\n\nFuture enhancement:\nDirect Outlook integration may be added to streamline this workflow."
    },
    {
      "level": 3,
      "title": "What if contact details are missing?",
      "content": "If a contact is missing role, email, or phone:\n• When you select them during filing, you'll see the missing fields\n• Click \"Edit contact details\" to add them inline\n• You don't have to navigate away - stay in the flow\n\nWhy add details:\n• Makes it easier to reach them later\n• Ensures exports include complete contact information\n• Helps teammates know who is who"
    },
    {
      "level": 2,
      "title": "Troubleshooting",
      "content": ""
    },
    {
      "level": 3,
      "title": "\"AI Formatting Failed\" - What to Do",
      "content": "What happened:\nThe AI formatting service (Anthropic API) couldn't process your entry. This could be due to:\n• Network connectivity issues\n• API service outage\n• Rate limiting (too many requests)\n\nWhat to do:\nYour entry is saved as \"unformatted\" - nothing is lost\nA \"Format later\" button appears on the entry\nWait a few minutes and click \"Format later\"\nIf it still fails, contact your administrator\n\nWorkaround:\nYou can manually edit the entry to improve formatting:\nClick \"Edit\" on the unformatted entry\nAdd line breaks, clean up spacing, format lists\nSave your manual edits\n\nYour data is safe:\nEven if AI formatting permanently fails, you have the original text saved."
    },
    {
      "level": 3,
      "title": "\"Duplicate Entry Detected\" - Your Options",
      "content": "What happened:\nCorrespondence Clerk noticed you're trying to save an entry that looks very similar to one you recently filed.\n\nYour options:\nSave anyway - if this is legitimately a new entry (e.g., follow-up with similar wording)\nView existing entry - to confirm it's already filed\nCancel - to avoid the duplicate\n\nWhy this check exists:\nPrevents accidental double-filing (e.g., pasting the same email twice)."
    },
    {
      "level": 3,
      "title": "Email Thread Split Didn't Work",
      "content": "What went wrong:\nThe thread detection may have:\n• Missed some emails in the chain\n• Split incorrectly\n• Not detected a thread at all\n\nWhat to do:\nIf split incorrectly: Delete the incorrect entries and refile manually\nIf not detected: Manually split by pasting each email separately\nIf some emails missed: Add them as separate entries\n\nWhy it happens:\nEmail threads have many formats (Gmail, Outlook, Apple Mail, etc.). The detection is smart but not perfect.\n\nTip:\nFor important threads, review the preview before confirming the split."
    },
    {
      "level": 3,
      "title": "Can't Save Entry (Missing Required Fields)",
      "content": "Required fields:\n• Business (must select)\n• Contact (must select)\n• Content (must have text)\n\nIf you can't save:\nCheck that you've selected a business\nCheck that you've selected a contact\nEnsure there's text in the entry field\n\nIf you're missing a contact:\n• Click \"Add New Contact\" to create one\n• You must name a real person (no placeholders)"
    },
    {
      "level": 3,
      "title": "Outlook Integration Not Working",
      "content": "Current status:\nThere's no direct Outlook integration yet. You must manually copy-paste.\n\nWorkaround:\nOpen email in Outlook\nSelect all (Ctrl+A) and copy (Ctrl+C)\nPaste into Correspondence Clerk\nFile as usual\n\nFuture:\nOutlook add-in or integration may be developed to streamline this."
    },
    {
      "level": 3,
      "title": "Contact Details Missing",
      "content": "If a contact is missing role, email, or phone:\nFind the contact in the business letter file's Contacts section\nClick \"Edit\" next to the contact\nAdd the missing details\nSave\n\nOr add them during filing:\n• When selecting a contact in New Entry\n• If details are missing, an \"Add details\" option appears\n• Add inline without leaving the page"
    },
    {
      "level": 2,
      "title": "For Team Administrators",
      "content": ""
    },
    {
      "level": 3,
      "title": "Inviting Team Members",
      "content": "To invite someone:\nGo to Settings > Organization\nClick \"Invite Team Member\"\nEnter their email address\nThey receive an invitation link via email\nThey click the link, create their account, and join your organization\n\nWhat they see after joining:\n• All businesses you've created\n• All correspondence filed by anyone on the team\n• They can immediately start filing new entries\n\nManaging invitations:\n• View pending invitations in Settings > Organization\n• Resend if needed\n• Revoke if someone shouldn't join"
    },
    {
      "level": 3,
      "title": "Managing Organization Settings",
      "content": "Organization details:\n• Name - your company or team name\n• Settings - (future) customization options\n\nTeam member list:\n• View all active team members\n• See who's invited but hasn't accepted yet\n• (Future) Remove team members"
    },
    {
      "level": 3,
      "title": "What Everyone Can See (Shared Visibility)",
      "content": "Current permissions (v1):\n• Everyone in your organization sees all businesses\n• Everyone sees all correspondence\n• Everyone can file, edit, search, and export\n\nWhy it's designed this way:\nCorrespondence Clerk is built for team transparency. Shared visibility prevents:\n• Duplicated effort (two people following up with the same business)\n• Lost context (someone leaves, their correspondence is still accessible)\n• Siloed knowledge (everyone benefits from the letter file)\n\nFuture versions:\n• Per-business access controls\n• Read-only users\n• Audit trail for edits\n\n\n\n_Auto-generated content will appear here when you run npm run update-docs_"
    },
    {
      "level": 2,
      "title": "Glossary",
      "content": ""
    },
    {
      "level": 3,
      "title": "Club Card",
      "content": "A membership category for businesses in the Chiswick Calendar. Club Card members receive certain benefits and are tracked separately from advertisers."
    },
    {
      "level": 3,
      "title": "Advertiser",
      "content": "A business that purchases advertising in the Chiswick Calendar. Some businesses are both Club Card and Advertiser."
    },
    {
      "level": 3,
      "title": "Action Needed",
      "content": "A flag on correspondence entries indicating follow-up is required. Types:"
    },
    {
      "level": 3,
      "title": "Action Needed Types",
      "content": "When filing correspondence, you can flag entries that need follow-up:\n\nnone - No action required, just for the record\n\nprospect - New business opportunity, needs initial outreach\n\nfollow_up - Requires a response or continued conversation\n\nwaiting_on_them - Ball is in their court, waiting for their response\n\ninvoice - Need to send or follow up on an invoice\n\nrenewal - Contract or membership renewal coming up\n\nThese flags help the Dashboard sort businesses by what needs doing."
    },
    {
      "level": 3,
      "title": "Due Date",
      "content": "An optional reminder date for correspondence flagged with \"Action Needed\". Overdue entries appear at the top of the Dashboard."
    },
    {
      "level": 3,
      "title": "Thread Splitting",
      "content": "The process of detecting an email chain and splitting it into individual entries, each with its own date and sender."
    },
    {
      "level": 3,
      "title": "Formatting",
      "content": "The process of improving the visual layout of your text using AI. Formatting:\n• Adds proper spacing and line breaks\n• Formats lists and headers\n• Cleans up email artifacts\n• Never changes your wording"
    },
    {
      "level": 3,
      "title": "Letter File",
      "content": "The chronological feed of correspondence for a business. Like the old Word document letter files, but searchable and automatically maintained."
    },
    {
      "level": 3,
      "title": "Mastersheet",
      "content": "The Chiswick Calendar spreadsheet of businesses, contacts, and contract details. This data can be imported into Correspondence Clerk to seed your business list."
    },
    {
      "level": 3,
      "title": "MCP (Model Context Protocol)",
      "content": "The method used to integrate with Google Docs for exporting letter files."
    },
    {
      "level": 3,
      "title": "Raw Text Original",
      "content": "The exact text you entered when creating a correspondence entry. This field is never modified, serving as your permanent record of what was actually said."
    },
    {
      "level": 3,
      "title": "Formatted Text Original",
      "content": "The AI-formatted version of your text when first saved. Also never modified."
    },
    {
      "level": 3,
      "title": "Formatted Text Current",
      "content": "The version of formatted text currently displayed. This is the only field you can manually edit."
    },
    {
      "level": 3,
      "title": "Unformatted Entry",
      "content": "A correspondence entry that was saved when AI formatting was unavailable. Can be formatted later using the \"Format later\" button."
    },
    {
      "level": 3,
      "title": "Organization",
      "content": "Your team's workspace in Correspondence Clerk. All team members belong to one organization and share visibility of all data."
    },
    {
      "level": 3,
      "title": "Contact",
      "content": "A person at a business. Every correspondence entry must link to a specific contact (no placeholders allowed)."
    },
    {
      "level": 3,
      "title": "Business",
      "content": "A company or organization you track. Businesses contain contacts and correspondence."
    },
    {
      "level": 2,
      "title": "Need More Help?",
      "content": "Found a bug or have feedback?\nReport issues at: https://github.com/anthropics/claude-code/issues\n\nQuestions not covered here?\n• Check the Dashboard for tooltips and hints\n• Contact your team administrator\n• Refer to ARCHITECTURE.md for technical details (developers only)\n\n\n\nLast Updated: Auto-generated - see npm run update-docs"
    },
    {
      "level": 3,
      "title": "Why the App Works This Way",
      "content": "You must always name a contact\nThe app requires you to select (or create) a specific person for every entry. This ensures your letter file is always clear about who you spoke with. No \"Unknown\" or placeholder contacts allowed.\n\nYour original wording is never changed\nWhen AI formats your text, it only improves layout and spacing. Your actual words are preserved exactly as you wrote them in the raw_text_original field, which is never modified.\n\nContact details are always visible\nWhen you select a contact, you can immediately see their role, email, and phone. If details are missing, you can add them inline without leaving the filing flow.\n\nAI failure never blocks you\nIf the AI formatting service is unavailable, you can still save your correspondence. It's marked as \"unformatted\" and you can format it later when the service is back.\n\nEdits are corrections, not rewrites\nWhen you edit an entry, you're making manual corrections. The AI never rewrites your content. We preserve both the original formatted version and your edited version.\n\nNo automatic suggestions\nThis is a filing system, not a CRM. We don't suggest next steps, auto-follow-ups, or reminders you didn't create. We record what happened.\n\nClear, labeled actions\nEvery button and action is clearly labeled. No icon-only buttons that leave you guessing.\n\nThread splitting is optional\nWhen you paste an email chain, we detect it and offer to split it into individual entries. But you always get to confirm before we do it.\n\nFull text search is fast\nWe use PostgreSQL's full-text search with GIN indexes, so searching through thousands of entries is near-instant.\n\nExports are print-ready\nGoogle Docs exports use proper formatting with page breaks, so you can print or share them immediately."
    },
    {
      "level": 3,
      "title": "Available Features",
      "content": "Home Page\nLanding page with login\nRoute: /\n\nDashboard\nView all businesses at a glance, sorted by what needs doing\nRoute: /dashboard\n\nNew Entry\nFile new emails, calls, and meeting notes\nRoute: /new-entry\n\nBusiness Letter File\nView chronological correspondence history per business\nRoute: /businesses/[id]\n\nSearch\nFind past correspondence by business name or keyword\nRoute: /search\n\nOrganization Settings\nManage your team and organization settings\nRoute: /settings/organization\n\nAccept Invitation\nJoin your team by accepting an invitation\nRoute: /invite/accept\n\nImport Businesses\nBulk import businesses from CSV (admin only)\nRoute: /admin/import\n\nImport from Google Docs\nImport correspondence from existing Google Docs\nRoute: /admin/import-google-docs"
    },
    {
      "level": 3,
      "title": "Technical Configuration (For Administrators)",
      "content": "These settings are configured during initial setup:\n\nNEXT_PUBLIC_SUPABASE_URL\nWhere your database is hosted. Set by your administrator during installation. This is the URL of your Supabase project.\n\nNEXT_PUBLIC_SUPABASE_ANON_KEY\nPublic key for database access. Safe to expose in browser, as it's protected by Row Level Security policies.\n\nSUPABASE_SERVICE_ROLE_KEY\nAdmin key for server-side operations. Never expose to the client. Used for operations that bypass RLS.\n\nANTHROPIC_API_KEY\nEnables AI formatting. If this stops working, entries save as \"unformatted\" until fixed. You can still file correspondence without AI.\n\nNEXT_PUBLIC_APP_URL\nThe web address where Correspondence Clerk is accessed (e.g., https://correspondence-clerk.vercel.app).\n\nGOOGLE_CLIENT_ID and GOOGLE_CLIENT_SECRET\nRequired for Google Docs export feature. Get these from Google Cloud Console.\n\nWhat happens if a key stops working?\n• If Anthropic API fails: Correspondence saves as \"unformatted\" - you can format it later\n• If Supabase fails: App won't load - contact your administrator\n• If Google API fails: Export feature won't work, but filing correspondence continues normally"
    }
  ],
  "metadata": {
    "exportedAt": "2026-01-20T23:13:28.123Z",
    "sourceFile": "C:\\Users\\Bridg\\Projects\\correspondence-clerk\\docs\\USER_GUIDE.md",
    "version": "1.0.0"
  }
}